package Day14;

public class Day14_1_Class {
	
	public static void main(String[] args) {
		// 클래스
		 	// 클래스를 사용하는 이유 
		 	// 1. 여러개의 변수[메모리] 묶음 관리
				// 예) 회원
				// 회원가입할 때 필요한 기록[메모리]
				// 객체화가 아닌 경우 -> 변수 이용
				// 회원이 추가될 때마다 변수의 수가 늘어남 -> 관리가 어려움
				// 배열을 사용 -> 동일한 자료형만 가능
			// 2. 클래스(설계도) 기반으로 많은 (서로 다른) 객체 생성 가능
				// 예) 주차관리
				// 차량번호, 입차시간, 출차시간, 금액	
				// 차량 객체 -> 변수 * 차량수 or 차량수 * 객체수
			// 3. API(라이브러리) : 미리 만들어진 클래스
				// * String class 중요
				// * Scanner
				// 만들어진 클래스를 이용한 빠른 개발 가능
			// 4
				// 1) 필드 [기록 = 저장] 2) 생성자 [객체 생성 시 초기 값] 3) 메소드
				// 필드 : 변수, 배열, 객체, 인터페이스 등
				// 생성자 : 선택사항
				// 메소드 : 코드 묶음 처리
	} 

}
